In [1]:
import pandas as pd

In [2]:
people = {'first':['nishant', 'akshay', 'manoj'],
         'last':['chauhan', 'kumar', 'chauhan'],
         'email':['nich@gmail.com', 'akku@gmail.com', 'mach@gmail.com']}
df = pd.DataFrame(people)
df

     first     last           email
0  nishant  chauhan  nich@gmail.com
1   akshay    kumar  akku@gmail.com
2    manoj  chauhan  mach@gmail.com

In [5]:
df['full_name'] = df['first']+' '+df['last']

In [6]:
df

     first     last           email        full_name
0  nishant  chauhan  nich@gmail.com  nishant chauhan
1   akshay    kumar  akku@gmail.com     akshay kumar
2    manoj  chauhan  mach@gmail.com    manoj chauhan

In [8]:
df.drop(['first', 'last'], axis = 1, inplace=True)

In [9]:
df

            email        full_name
0  nich@gmail.com  nishant chauhan
1  akku@gmail.com     akshay kumar
2  mach@gmail.com    manoj chauhan

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [13]:
df

            email        full_name    first     last
0  nich@gmail.com  nishant chauhan  nishant  chauhan
1  akku@gmail.com     akshay kumar   akshay    kumar
2  mach@gmail.com    manoj chauhan    manoj  chauhan

In [16]:
#adding a single row to dtaframe using append
df.append({'first':'ritesh'}, ignore_index=True)

C:\Users\hp\AppData\Local\Temp\ipykernel_6676\2026268342.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'ritesh'}, ignore_index=True)

            email        full_name    first     last
0  nich@gmail.com  nishant chauhan  nishant  chauhan
1  akku@gmail.com     akshay kumar   akshay    kumar
2  mach@gmail.com    manoj chauhan    manoj  chauhan
3             NaN              NaN   ritesh      NaN

In [18]:
people = {'first':['Tony', 'Steve'],
         'last':['Stark', 'Rogers'],
         'email':['IronMan@avenge.com', 'Cap@avenge.com']}
df2 = pd.DataFrame(people)
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [20]:
#append a new dataframe to another
df = df.append(df2, ignore_index= True, sort= False)

C:\Users\hp\AppData\Local\Temp\ipykernel_6676\2844358714.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index= True, sort= False)

In [21]:
df

                email        full_name    first     last
0      nich@gmail.com  nishant chauhan  nishant  chauhan
1      akku@gmail.com     akshay kumar   akshay    kumar
2      mach@gmail.com    manoj chauhan    manoj  chauhan
3  IronMan@avenge.com              NaN     Tony    Stark
4      Cap@avenge.com              NaN    Steve   Rogers

In [24]:
#deleting a row in dataframe
df.drop(index=[3,4], inplace=True)

In [25]:
df

            email        full_name    first     last
0  nich@gmail.com  nishant chauhan  nishant  chauhan
1  akku@gmail.com     akshay kumar   akshay    kumar
2  mach@gmail.com    manoj chauhan    manoj  chauhan

In [31]:
df.drop(index = df[df['last'] == 'chauhan'].index)

            email     full_name   first   last
1  akku@gmail.com  akshay kumar  akshay  kumar

In [32]:
df

            email        full_name    first     last
0  nich@gmail.com  nishant chauhan  nishant  chauhan
1  akku@gmail.com     akshay kumar   akshay    kumar
2  mach@gmail.com    manoj chauhan    manoj  chauhan

In [33]:
#similar way as above
filt = df['last'] == 'chauhan'
df.drop(index = df[filt].index)

            email     full_name   first   last
1  akku@gmail.com  akshay kumar  akshay  kumar